<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/1_Pivot_With_Case_Statements/2_Sum_Aggregation.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Conditional Aggregation

**Product focused**

## Overview

### ü•Ö Analysis Goals

Use the following to do an EDA of the products and their categories ordered from the `sales` table.
- Total sales in 2023 and 2022.
- Compare total sales of products ordered in 2023 and 2022
- Categorize sales as low or high.

### üìò Concepts Covered

- `SUM` Review
- `SUM` with `CASE WHEN`

---

In [20]:
import sys
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the ipython-sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'postgresql://postgres:***@localhost:5432/contoso_100k'

---
## SUM Review

### üìù¬†Notes

`SUM`

- **SUM** adds up all numeric values in a specified column, excluding NULL values.

- Syntax:

  ```sql
  SUM(column_name)
  ```

- Example:

  ```sql
  SELECT SUM(order_amount) AS total_revenue
  FROM orders;
  ```

### üíª¬†Final Result

- Find the total sales by day in 2023 and 2022.

#### Total Net Revenue by Day in 2023

**`SUM`**

1. Find the net revenue by orderdate for 2023 orders.

In [25]:
%%sql

SELECT
    s.orderdate,
    SUM(s.quantity * s.netprice * s.exchangerate) AS net_revenue -- Added
FROM
    sales s
WHERE
    s.orderdate::date BETWEEN '2023-01-01' AND '2023-12-31'
GROUP BY   
    s.orderdate
ORDER BY
    s.orderdate

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

364 rows affected.

      orderdate    net_revenue
0    2023-01-01   30140.799315
1    2023-01-02  107847.490191
2    2023-01-03  192655.596657
3    2023-01-04  189451.707871
4    2023-01-05  216573.229817
..          ...            ...
359  2023-12-27  141981.336234
360  2023-12-28  138772.189742
361  2023-12-29   85913.440327
362  2023-12-30  165917.019796
363  2023-12-31    5594.655048

[364 rows x 2 columns]

#### Total Net Revenue by Product Category in 2023 and 2022

**`SUM`**

1. Find the total net revenue by the product category for 2023 orders.

In [30]:
%%sql

SELECT
    p.categoryname AS category_name, -- Added
    SUM(s.quantity * s.netprice * s.exchangerate) AS net_revenue
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey -- Added
WHERE
    s.orderdate::date BETWEEN '2023-01-01' AND '2023-12-31'
GROUP BY
    p.categoryname -- Update
ORDER BY
    p.categoryname -- Update

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                   category_name  net_revenue
0                          Audio    688690.18
1        Cameras and camcorders    1983546.29
2                    Cell phones   6002147.63
3                      Computers  11650867.21
4                 Games and Toys    270374.96
5                Home Appliances   5919992.87
6  Music, Movies and Audio Books   2180768.13
7                   TV and Video   4412178.23

2. Find the total net revenue by the product category for 2022 orders.

In [31]:
%%sql

SELECT
    p.categoryname AS category_name,
    SUM(s.quantity * s.netprice * s.exchangerate) AS net_revenue
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
WHERE
    s.orderdate::date BETWEEN '2022-01-01' AND '2022-12-31' -- Updated
GROUP BY
    p.categoryname
ORDER BY
    p.categoryname

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                   category_name  net_revenue
0                          Audio    766938.21
1        Cameras and camcorders    2382532.56
2                    Cell phones   8119665.07
3                      Computers  17862213.49
4                 Games and Toys    316127.30
5                Home Appliances   6612446.68
6  Music, Movies and Audio Books   2989297.28
7                   TV and Video   5815336.61

---
## SUM with CASE WHEN

### üìù¬†Notes

`SUM(CASE WHEN)`

- **Pivot with SUM (using `CASE WHEN` statements)** enables pivoting data by summing values based on conditional logic.

- Syntax:

  ```sql
  SUM(CASE WHEN condition THEN column ELSE 0 END) AS alias
  ```

- Example:

  ```sql
  SELECT 
    SUM(CASE WHEN region = 'North' THEN sales END) AS north_sales,
    SUM(CASE WHEN region = 'South' THEN sales END) AS south_sales
  FROM sales_data;
  ```

### üíª¬†Final Result

- Compare total sales of products by category ordered in 2023 and 2022,

#### Total Sales by Category and Year (2022 vs 2023)

**`CASE WHEN` and `SUM`**

1. Pivot to get the total sales by category and compare 2023 with 2022.

In [32]:
%%sql 

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN s.orderdate::date BETWEEN '2022-01-01' AND '2022-12-31' THEN (s.quantity * s.netprice * s.exchangerate) END) AS y2022_total_sales,
    SUM(CASE WHEN s.orderdate::date BETWEEN '2023-01-01' AND '2023-12-31' THEN (s.quantity * s.netprice * s.exchangerate) END) AS y2023_total_sales
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
GROUP BY
    p.categoryname
ORDER BY
    p.categoryname;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                        category  y2022_total_sales  y2023_total_sales
0                          Audio          766938.21          688690.18
1        Cameras and camcorders          2382532.56         1983546.29
2                    Cell phones         8119665.07         6002147.63
3                      Computers        17862213.49        11650867.21
4                 Games and Toys          316127.30          270374.96
5                Home Appliances         6612446.68         5919992.87
6  Music, Movies and Audio Books         2989297.28         2180768.13
7                   TV and Video         5815336.61         4412178.23

#### Categorize as Low and High for Total Sale

**`SUM`**, **`CASE WHEN`**

1. Categorize the sale as low or high and find the total sales by category and low or high.

In [ ]:
%%sql 

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN (s.quantity * s.netprice * exchangerate) < 1000 THEN (s.quantity * s.netprice * exchangerate) END) AS low_total_sales,
    SUM(CASE WHEN (s.quantity * s.netprice * exchangerate) >= 1000 THEN (s.quantity * s.netprice * exchangerate) END) AS high_total_sales
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
WHERE
    orderdate::date BETWEEN '2022-01-01' AND '2023-12-31' 
GROUP BY
    category
ORDER BY
    category;